export default {
  projections: {
    СогласиеНаОпдE: {
      номерДок: {
        __caption__: 'Номер док'
      },
      дата: {
        __caption__: 'Дата'
      },
      подписано: {
        __caption__: 'Подписано'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    },
    СогласиеНаОпдL: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      подписано: {
        __caption__: 'Подписано'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    номерДок: {
      __caption__: 'Номер док'
    },
    отправлено: {
      __caption__: 'Отправлено'
    },
    подписано: {
      __caption__: 'Подписано'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    }
  }
};
