export default {
  projections: {
    РасчетныйЛистE: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      итогоНачис: {
        __caption__: 'Итого начислено'
      },
      итогоУдер: {
        __caption__: 'Итого удержано'
      },
      итогоКПере: {
        __caption__: 'Итого к перечислению'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        }
      },
      составРасчета: {
        __caption__: 'Состав расчета',
        тип: {
          __caption__: 'Тип'
        },
        наименование: {
          __caption__: 'Наименование'
        },
        сумма: {
          __caption__: 'Сумма'
        },
        ндфл: {
          __caption__: 'НДФЛ'
        },
        взносы: {
          __caption__: 'Страховые взносы'
        },
        всего: {
          __caption__: 'Всего'
        }
      }
    },
    РасчетныйЛистL: {
      номерДок: {
        __caption__: 'Номер документа'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      итогоНачис: {
        __caption__: 'Итого начислено'
      },
      итогоУдер: {
        __caption__: 'Итого удержано'
      },
      итогоКПере: {
        __caption__: 'Итого к перечислению'
      },
      отправлено: {
        __caption__: 'Отправлено'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата составления'
    },
    итогоКПере: {
      __caption__: 'Итого к перечислению'
    },
    итогоНачис: {
      __caption__: 'Итого начислено'
    },
    итогоУдер: {
      __caption__: 'Итого удержано'
    },
    номерДок: {
      __caption__: 'Номер документа'
    },
    отправлено: {
      __caption__: 'Отправлено'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    },
    составРасчета: {
      __caption__: 'Состав расчета'
    }
  }
};
